article/application-level-cache.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-08-05 Thu 18:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>应用级别缓存</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jinghui Hu" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../readme.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">应用级别缓存</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8c04a51">1. 应用级别缓存</a></li>
<li><a href="#org8d5d44c">2. 数据库查询级别的缓存</a></li>
<li><a href="#org4c2484e">3. 对象级别的缓存</a></li>
<li><a href="#org92ee1c0">4. 更新缓存的时机</a>
<ul>
<li><a href="#orge98f473">4.1. 缓存模式</a></li>
<li><a href="#org5b5fd5e">4.2. 直写模式</a></li>
<li><a href="#orga14ded8">4.3. 回写模式</a></li>
<li><a href="#orgaffc2ae">4.4. 刷新</a></li>
</ul>
</li>
<li><a href="#org8e3beca">5. 缓存的缺点</a></li>
</ul>
</div>
</div>


<div id="outline-container-org8c04a51" class="outline-2">
<h2 id="org8c04a51"><span class="section-number-2">1</span> 应用级别缓存</h2>
<div class="outline-text-2" id="text-1">
<p>
基于内存的缓存比如 Memcached 和 Redis 是应用程序和数据存储之间的一种键值存储。
由于数据保存在 RAM 中，它比存储在磁盘上的典型数据库要快多了。RAM 比磁盘限制更
多，所以例如 LRU 的缓存无效算法可以将 “热门数据” 放在 RAM 中，而对一些比较 “冷
门” 的数据不做处理
</p>

<p>
Redis 有下列附加功能
</p>
<ol class="org-ol">
<li>持久性选项，支持 RDB 和 AOF 的持久化操作</li>
<li>内置数据结构比如有序集合和列表</li>
</ol>

<p>
有多个缓存级别，分为两大类： 数据库查询和对象
</p>
<ol class="org-ol">
<li>行级别</li>
<li>查询级别</li>
<li>完整的可序列化对象</li>
<li>完全渲染的 HTML</li>
</ol>

<p>
一般来说，你应该尽量避免基于文件的缓存，因为这使得复制和自动缩放很困难。
</p>
</div>
</div>

<div id="outline-container-org8d5d44c" class="outline-2">
<h2 id="org8d5d44c"><span class="section-number-2">2</span> 数据库查询级别的缓存</h2>
<div class="outline-text-2" id="text-2">
<p>
当你查询数据库的时候，将查询语句的哈希值与查询结果存储到缓存中。这种方法会遇到
以下问题：
</p>
<ol class="org-ol">
<li>很难用复杂的查询删除已缓存结果。</li>
<li>如果一条数据比如表中某条数据的一项被改变，则需要删除所有可能包含已更改项的
缓存结果。</li>
</ol>
</div>
</div>

<div id="outline-container-org4c2484e" class="outline-2">
<h2 id="org4c2484e"><span class="section-number-2">3</span> 对象级别的缓存</h2>
<div class="outline-text-2" id="text-3">
<p>
将您的数据视为对象，就像对待你的应用代码一样。让应用程序将数据从数据库中组合到
类实例或数据结构中：
</p>
<ol class="org-ol">
<li>如果对象的基础数据已经更改了，那么从缓存中删掉这个对象</li>
<li>允许异步处理：workers 通过使用最新的缓存对象来组装对象</li>
</ol>

<p>
建议缓存的内容：
</p>
<ol class="org-ol">
<li>用户会话</li>
<li>完全渲染的 Web 页面</li>
<li>活动流</li>
<li>用户图数据</li>
</ol>
</div>
</div>

<div id="outline-container-org92ee1c0" class="outline-2">
<h2 id="org92ee1c0"><span class="section-number-2">4</span> 更新缓存的时机</h2>
<div class="outline-text-2" id="text-4">
<p>
由于你只能在缓存中存储有限的数据，所以你需要选择一个适用于你用例的缓存更新策略
</p>
</div>
<div id="outline-container-orge98f473" class="outline-3">
<h3 id="orge98f473"><span class="section-number-3">4.1</span> 缓存模式</h3>
<div class="outline-text-3" id="text-4-1">
<p>
应用从存储器读写。缓存不和存储器直接交互，应用执行以下操作：
</p>
<ol class="org-ol">
<li>在缓存中查找记录，如果所需数据不在缓存中</li>
<li>从数据库中加载所需内容</li>
<li>将查找到的结果存储到缓存中</li>
<li>返回所需内容</li>
</ol>

<div class="org-src-container">
<pre class="src src-text">[App] &lt;-----------&gt; [Cache]
  ^
  |
  +---------------&gt; [Database]
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">get_user</span><span style="color: #8d5649;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span>, user_id<span style="color: #8d5649;">)</span>:
    <span style="color: #7590db;">user</span> = cache.get<span style="color: #8d5649;">(</span><span style="color: #2d9574;">"user.{0}"</span>, user_id<span style="color: #8d5649;">)</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span> user <span style="color: #4f97d7; font-weight: bold;">is</span> <span style="color: #a45bad;">None</span>:
        <span style="color: #7590db;">user</span> = db.query<span style="color: #8d5649;">(</span><span style="color: #2d9574;">"SELECT * FROM users WHERE user_id = {0}"</span>, user_id<span style="color: #8d5649;">)</span>
        <span style="color: #4f97d7; font-weight: bold;">if</span> user <span style="color: #4f97d7; font-weight: bold;">is</span> <span style="color: #4f97d7; font-weight: bold;">not</span> <span style="color: #a45bad;">None</span>:
            <span style="color: #7590db;">key</span> = <span style="color: #2d9574;">"user.{0}"</span>.<span style="color: #4f97d7;">format</span><span style="color: #8d5649;">(</span>user_id<span style="color: #8d5649;">)</span>
            cache.<span style="color: #4f97d7;">set</span><span style="color: #8d5649;">(</span>key, json.dumps<span style="color: #d8241f;">(</span>user<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span> user
</pre>
</div>

<ul class="org-ul">
<li>Memcached 通常用这种方式使用</li>
<li>添加到缓存中的数据读取速度很快。缓存模式也称为延迟加载</li>
<li>只缓存所请求的数据，这避免了没有被请求的数据占满了缓存空间</li>
</ul>

<p>
缓存模式的缺点
</p>
<ol class="org-ol">
<li>请求的数据如果不在缓存中就需要经过三个步骤来获取数据，这会导致明显的延迟</li>
<li>如果数据库中的数据更新了会导致缓存中的数据过时。这个问题需要通过设置 TTL
强制更新缓存或者直写模式来缓解这种情况</li>
<li>当一个节点出现故障的时候，它将会被一个新的节点替代，这增加了延迟的时间</li>
</ol>
</div>
</div>

<div id="outline-container-org5b5fd5e" class="outline-3">
<h3 id="org5b5fd5e"><span class="section-number-3">4.2</span> 直写模式</h3>
<div class="outline-text-3" id="text-4-2">
<p>
应用使用缓存作为主要的数据存储，将数据读写到缓存中，而缓存负责从数据库中读写
数据
</p>
<ol class="org-ol">
<li>应用向缓存中添加/更新数据</li>
<li>缓存同步地写入数据存储</li>
<li>返回所需内容</li>
</ol>
<p>
由于存写操作所以直写模式整体是一种很慢的操作，但是读取刚写入的数据很快。相比
读取数据，用户通常比较能接受更新数据时速度较慢。缓存中的数据不会过时
</p>

<div class="org-src-container">
<pre class="src src-text">  +----------- 3. Return to App ----------+
  |                                       |
  v                                       |
[App] -- 1. Write to Cache --&gt; [Cache] ---+
                                  |
                           2. Store in DB
                                  |
                                  v
                              [Database]
</pre>
</div>

<p>
应用代码
</p>
<div class="org-src-container">
<pre class="src src-python">set_user<span style="color: #8d5649;">(</span>12345, <span style="color: #d8241f;">{</span><span style="color: #2d9574;">"foo"</span>:<span style="color: #2d9574;">"bar"</span><span style="color: #d8241f;">}</span><span style="color: #8d5649;">)</span>
</pre>
</div>

<p>
缓存代码：
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">set_user</span><span style="color: #8d5649;">(</span>user_id, values<span style="color: #8d5649;">)</span>:
    <span style="color: #7590db;">user</span> = db.query<span style="color: #8d5649;">(</span><span style="color: #2d9574;">"UPDATE Users WHERE id = {0}"</span>, user_id, values<span style="color: #8d5649;">)</span>
    cache.<span style="color: #4f97d7;">set</span><span style="color: #8d5649;">(</span>user_id, user<span style="color: #8d5649;">)</span>
</pre>
</div>

<p>
直写模式的缺点：
</p>
<ol class="org-ol">
<li>由于故障或者缩放而创建的新的节点，新的节点不会缓存，直到数据库更新为止。缓
存应用直写模式可以缓解这个问题</li>
<li>写入的大多数数据可能永远都不会被读取，用 TTL 可以最小化这种情况的出现</li>
</ol>
</div>
</div>

<div id="outline-container-orga14ded8" class="outline-3">
<h3 id="orga14ded8"><span class="section-number-3">4.3</span> 回写模式</h3>
<div class="outline-text-3" id="text-4-3">
<p>
在回写模式中，应用执行以下操作
</p>
<ol class="org-ol">
<li>在缓存中增加或者更新条目</li>
<li>异步写入数据，提高写入性能</li>
</ol>

<div class="org-src-container">
<pre class="src src-text">  +----------- 3. Return to App ----------+
  |                                       |
  v                                       |
[App] -- 1. Write to Cache --&gt; [Cache] ---+
                                  |
                        2. Add event to Queue
                                  |
                                  v
                               [Queue]
                                  |
              4. Asynchronously: select and execute event
                                  |
                                  v
                              [Database]
</pre>
</div>

<p>
回写模式的缺点
</p>
<ol class="org-ol">
<li>缓存可能在其内容成功存储之前丢失数据</li>
<li>执行直写模式比缓存或者回写模式更复杂</li>
</ol>
</div>
</div>

<div id="outline-container-orgaffc2ae" class="outline-3">
<h3 id="orgaffc2ae"><span class="section-number-3">4.4</span> 刷新</h3>
<div class="outline-text-3" id="text-4-4">
<p>
你可以将缓存配置成在到期之前自动刷新最近访问过的内容。 如果缓存可以准确预测将
来可能请求哪些数据，那么刷新可能会导致延迟与读取时间的降低
</p>

<div class="org-src-container">
<pre class="src src-text">[App] &lt;------------ [Cache]
                       ^
                       |
           refresh to cache with strategy
                       |
                   [Database]
</pre>
</div>

<p>
刷新的缺点
</p>
<ol class="org-ol">
<li>不能准确预测到未来需要用到的数据可能会导致性能不如不使用刷新。</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org8e3beca" class="outline-2">
<h2 id="org8e3beca"><span class="section-number-2">5</span> 缓存的缺点</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>需要保持缓存和真实数据源之间的一致性，比如数据库根据缓存无效</li>
<li>需要改变应用程序比如增加 Redis 或者 Memcached</li>
<li>无效缓存是个难题，什么时候更新缓存是与之相关的复杂问题</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Last Updated 2021-08-05 Thu 18:53. Created by Jinghui Hu at 2021-08-05 Thu 18:23.</p>
</div>
</body>
</html>
